// 預設缺失類別與對應之缺失項目
export const ISSUE_TYPE = [
  {
    titles: [
      '墜落',
      '機械',
      '物料',
      '感電',
      '防護具',
      '穿刺',
      '爆炸',
      '工作場所',
      '搬運',
      '其他',
    ],
  },
  {
    title: '墜落',
    type: [
      '施工架組裝缺失',
      '開口墜落防護未設置或不合格',
      '安全母索未設置或不合格',
      '上下設備未設置或不合格',
      '工作平台不合格',
    ],
  },
  {
    title: '機械',
    type: [
      '機具使用不當',
      '機具不合格',
      '機具無檢查記錄表',
    ],
  },
  {
    title: '物料',
    type: ['物料放置不當'],
  },
  {
    title: '感電',
    type: [
      '電氣設備或電線未架高',
      '電氣設備或電線無防感電措施',
      '電氣設備無法上鎖或未上鎖',
      '電氣設備未張貼負責人聯絡方式',
    ],
  },
  {
    title: '防護具',
    type: [
      '工人未穿戴合格安全帽',
      '工人未穿戴合格安全帶',
      '工人安全帽帽扣未正確扣好',
    ],
  },
  {
    title: '穿刺',
    type: [
      '鋼筋未折彎或防護',
      '鐵釘未清除',
      '螺桿未清除',
    ],
  },
  {
    title: '爆炸',
    type: [
      '鋼瓶放置不當',
      '鋼瓶設備有缺漏',
      '易燃或易爆物旁無滅火器',
      '滅火器不合格',
      '防火標示不當',
    ],
  },
  {
    title: '工作場所',
    type: [
      '工區環境髒亂',
      '作業時未管制或無指揮人員',
      '工區內不可以有酒精性飲料',
      '工作場所有倒塌之風險',
      '工作場所有使人跌倒之風險',
      '照明相關缺失',
      '其他',
    ],
  },
  {
    title: '搬運',
    type: [
      '搬運或吊掛不當',
      '搬運或吊掛週邊缺失',
      '吊鉤不合格',
    ],
  },
  {
    title: '其他',
    type: ['其他'],
  },
];
