export const ISSUE_TYPE = [
  {
    titles: [
      '墜落',
      '機械',
      '物料',
      '感電',
      '防護具',
      '穿刺',
      '爆炸',
      '工作場所',
      '搬運',
      '其他',
    ],
  },
  {
    title: '墜落',
    type: [
      '取消',
      '施工架拉桿拆除未復原',
      '交叉拉桿不得取代gip鋼管',
      '開口防墜網不完善',
      '開口護欄不完善',
      '施工架架設不當',
      '合梯設置不當',
      '墜落警告設置不當',
    ],
  },
  {
    title: '機械',
    type: ['取消', '機具未設置防護罩', '設備有缺漏'],
  },
  {
    title: '物料',
    type: ['取消', '物料放置不當'],
  },
  {
    title: '感電',
    type: [
      '取消',
      '電盤未架高',
      '電線裸露或破損',
      '配電設施未上鎖',
      '感電設施設置不當',
    ],
  },
  {
    title: '防護具',
    type: ['取消', '安全帶穿戴不當', '安全帽配帶不當', '安全母索使用不當'],
  },
  {
    title: '穿刺',
    type: ['取消', '鋼筋未折彎或防護', '板材有穿刺物'],
  },
  {
    title: '爆炸',
    type: [
      '取消',
      '鋼瓶未固定',
      '鋼瓶放置地點不當',
      '鋼瓶設置有缺漏',
      '滅火器缺失',
      '防火標示缺失',
    ],
  },
  {
    title: '工作場所',
    type: [
      '取消',
      '工區內不可以有酒精性飲料',
      '車輛停放位置不當',
      '工區環境髒亂',
      '積水未清除',
      '支撐設置不當',
      '無交通指揮人員及指揮手',
      '照明燈具未全面開啟',
      '上下設備的支柱突出工區外道路',
      '工地推開門未上鎖',
    ],
  },
  {
    title: '搬運',
    type: ['取消', '吊鉤缺失', '吊掛周圍缺失'],
  },
  {
    title: '其他',
    type: ['取消', '其他'],
  },
];
